[
    {
        "id": 1,
        "title": "Chinese Soul in a French Body: A Romantic Connection with China",
        "writer": "Colt Steele",
        "body": "It is not uncommon to feel an inner struggle between two forces: optimism and pessimism, determination and procrastination, or…wanting to eat a cookie and keeping your dietary commitments. Perhaps less common is a feeling of belonging to two different cultures. As we constantly strive to balance these opposing forces we learn a lot about ourselves.?",
        "image": "https://i1.wp.com/ht-blog.oss-cn-hongkong.aliyuncs.com/wordpress/2018/09/HTC-July-Meetups.jpeg?w=1140&ssl=1"
    },
    {
        "id": 2,
        "title": "Ballroom Dancer: The First American to Join the LA Chinese Men’s Choir",
        "writer": "Colt Steele",
        "body": "I’ve been involved in dancing since my early 20s. Back when I lived on the East Coast I taught swing classes to groups of around 100 people in a place called the Swingers Palace. I also performed in entertainment venues like the Tutu Tango Cafe, where you dance while people eat. It was always a bit of extra income. Dancing has been a core part of my life since then. In the early days of learning I was fully focused on the topic, I incorporated many different ways of practice: I watched videos, memorised step lists, listened to dancing music, practiced both in the studio and at home! The same approach proved very useful later on, when I started learning Chinese.At that time, dance was just my side activity. The first “real” job I had was at a printing press. However, I quickly saw that it had no future. Computers were the future. It was with that conviction that my wife and I went into software.",
        "image": "https://i1.wp.com/ht-blog.oss-cn-hongkong.aliyuncs.com/wordpress/2019/01/David-Story-MrYu-Restaurant-opening.jpg?w=768&ssl=1"
    },
    {
        "id": 3,
        "title": "Who is on HelloTalk? Get the Data!",
        "writer": "Colt Steele",
        "body": "In a community of 13 million people there is a lot going on. While everyone is busy learning langauges, we can get a lot of insightful information about how, why, and what they learn.Want to know who your fellow HelloTalkers are? Below is a report we recently compiled. It was a lot of work—but wow!—it’s quite fascinating.",
        "image": "https://i1.wp.com/ht-blog.oss-cn-hongkong.aliyuncs.com/wordpress/2019/01/Kim-Story-Lucas.jpg?w=768&ssl=1"
    },
    {
        "id": 4,
        "title": "Find Your Language Tribe",
        "writer": "Colt Steele",
        "body": "These are the questions we ask ourselves everyday at HelloTalk. Every now and again we make moves to explore these mysteries. A while ago we reached out to some of the most active HelloTalkers—people who had thousands of followers. We were curious to learn who they are, and what lessons they can teach others.",
        "image": "https://i1.wp.com/ht-blog.oss-cn-hongkong.aliyuncs.com/wordpress/2019/01/HT-Users-horizontal-With-Logo.jpeg?w=768&ssl=1"
    },
    {
        "id": 5,
        "title": "Chinese Soul in a French Body: A Romantic Connection with China",
        "writer": "Colt Steele",
        "body": "It is not uncommon to feel an inner struggle between two forces: optimism and pessimism, determination and procrastination, or…wanting to eat a cookie and keeping your dietary commitments. Perhaps less common is a feeling of belonging to two different cultures. As we constantly strive to balance these opposing forces we learn a lot about ourselves.?",
        "image": "https://i1.wp.com/ht-blog.oss-cn-hongkong.aliyuncs.com/wordpress/2019/01/Kim-Story-Lucas.jpg?w=768&ssl=1"
    }
]